app/controllers/restaurants_controller.rb

  def update
    if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "restaurant_name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["restaurant_name", "Cheek By Jowl A"], ["updated_at", "2017-07-27 06:53:40.540332"], ["id", 1]]